https://www.hackerrank.com/domains/sql

# Revising the Select Query I

Query all columns for all American cities in the CITY table with populations larger than 100000. The CountryCode for America is USA.

The CITY table is described as follows:

In [ ]:
SELECT * FROM CITY 
WHERE POPULATION > 100000 AND CountryCode = 'USA';

# 오답 사례 : CountryCode == 'USA' // SQL 조건문에서 일치는 = 을 사용.

# Revising the Select Query II

Query the NAME field for all American cities in the CITY table with populations larger than 120000. The CountryCode for America is USA.

The CITY table is described as follows:

In [ ]:
SELECT NAME FROM CITY 
WHERE POPULATION > 120000 AND CountryCode = 'USA';

# Select All

Query all columns (attributes) for every row in the CITY table.

The CITY table is described as follows:

In [ ]:
SELECT * FROM CITY

# Select By ID

Query all columns for a city in CITY with the ID 1661.

The CITY table is described as follows:

In [ ]:
SELECT * FROM CITY
WHERE ID = '1661';

SELECT * FROM CITY
WHERE ID = 1661;

# Japanese Cities' Attributes



Query all attributes of every Japanese city in the CITY table. The COUNTRYCODE for Japan is JPN.

The CITY table is described as follows:

In [ ]:
SELECT * FROM CITY 
WHERE COUNTRYCODE = 'JPN';

# Japanese Cities' Names

Query the names of all the Japanese cities in the CITY table. The COUNTRYCODE for Japan is JPN.
The CITY table is described as follows:

In [ ]:
SELECT NAME FROM CITY
WHERE COUNTRYCODE = 'JPN';

# Weather Observation Station 1

Query a list of CITY and STATE from the STATION table.
The STATION table is described as follows:

In [ ]:
SELECT CITY, STATE FROM STATION
SELECT CITY, STATE FROM STATION;

# 오답 : SELECT CITY AND STATE FROM STATION;

# Weather Observation Station 3

Query a list of CITY names from STATION for cities that have an even ID number. Print the results in any order, but exclude duplicates from the answer.
The STATION table is described as follows:

In [ ]:
SELECT DISTINCT CITY FROM STATION
WHERE ID%2 = 0;

# https://www.databasejournal.com/features/mysql/article.php/3911786/Eliminating-Duplicate-Rows-from-MySQL-Result-Sets.htm
# DISTINCT : EXCLUDE DUPLICATES

# (HARD) Weather Observation Station 5

Query the two cities in STATION with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.
The STATION table is described as follows:

When ordered alphabetically, the CITY names are listed as ABC, DEF, PQRS, and WXY, with lengths  and . The longest name is PQRS, but there are  options for shortest named city. Choose ABC, because it comes first alphabetically.

In [ ]:
# 다른 유저 정답
select city, length(city) from station
order by length(city),city asc
limit 1;

select city, length(city) from station
order by length(city) desc
limit 1;
# --------------- # ---------------

# 도시와 도시 글자 개수를 리턴 받는데
# 도시 글자 개수가 최대인것. 그리고 ASC 순서.
SELECT CITY, CHAR_LENGTH(CITY) FROM STATION 
where CHAR_LENGTH(city) = (select max(CHAR_LENGTH(city)) from station)
order by city asc;

# 도시와 도시 글자 개수를 리턴 받는데
# 도시 글자 개수가 최소인것. 그리고 ASC 순서.
# 여러개라서 LIMIT 1
SELECT CITY, CHAR_LENGTH(CITY) FROM STATION 
where CHAR_LENGTH(city) = (select MIN(CHAR_LENGTH(city)) from station)
order by city asc
LIMIT 1;

# Weather Observation Station 6

Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:

In [ ]:
# SUBSTR : 1번째 위치에서 1개 글자를 읽는다.
select city from station 
where lower(SUBSTR(city,1,1)) in ('a','e','i','o','u');

# 정규표현식
select DISTINCT city from station where REGEXP_LIKE(city,'^[aeiouAEIOU]');

# Weather Observation Station 7

Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot contain duplicates.

In [ ]:
# 내 정답
select DISTINCT city from station 
where lower(SUBSTR(city,-1,1)) in ('a','e','i','o','u');

# 다른 사람 정답
SELECT DISTINCT CITY FROM STATION
WHERE REGEXP_LIKE(City, '[aeiouAEIOU]$');

# 정규표현식
# * 해당 문자의 패턴이 가 0개 이상 일치할 경우 
# + 해당 문자의 패턴이 가 1개 이상 일치할 경우 
# ? 앞 문자가 0개이거나 하나 일치할 경우 
# | OR를 사용하기 위한 연산자 
# ^ 문자열이 시작할 경우 
# $ 문자열이 끝날 경우 
# . NULL을 제외한 임의의 한 문자 
# [] 임의의 그룹, [] 안에서의 ^는 일치하지 않음을 의미 
# [1-9] 또는 [a-z]로 범위를 표현 
# {n} 3번만큼 일치시킴 
# {n,} 적어도 n번 이상만큼 일치시킴 
# {n, m} n번 이상일치시키되 m을 초과하지 않음

# Weather Observation Station 8

Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.

In [ ]:
SELECT CITY FROM STATION
where lower(SUBSTR(city,-1,1)) in ('a','e','i','o','u')
AND lower(SUBSTR(city,1,1)) in ('a','e','i','o','u');

# Weather Observation Station 9

Query the list of CITY names from STATION that do not start with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT CITY FROM STATION
WHERE lower(SUBSTR(city,1,1)) NOT in ('a','e','i','o','u');

# 정규 표현식
select distinct city from station 
where NOT REGEXP_LIKE(City, '^[aeiouAEIOU]');

# Weather Observation Station 10

Query the list of CITY names from STATION that do not end with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT CITY FROM STATION
WHERE lower(SUBSTR(city,-1,1)) NOT in ('a','e','i','o','u');

# 정규 표현식
select distinct city from station 
where NOT REGEXP_LIKE(City, '[aeiouAEIOU]$');

# Weather Observation Station 11

Query the list of CITY names from STATION that either do not start with vowels or do not end with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT CITY FROM STATION
WHERE lower(SUBSTR(city,-1,1)) NOT in ('a','e','i','o','u')
OR lower(SUBSTR(city,1,1)) NOT in ('a','e','i','o','u');

# 정규
select distinct city from station 
where NOT REGEXP_LIKE(City, '^[aeiouAEIOU]')
OR NOT REGEXP_LIKE(City, '[aeiouAEIOU]$');

# Weather Observation Station 12

Query the list of CITY names from STATION that do not start with vowels and do not end with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT CITY FROM STATION
WHERE lower(SUBSTR(city,-1,1)) NOT in ('a','e','i','o','u')
AND lower(SUBSTR(city,1,1)) NOT in ('a','e','i','o','u');

# 정규
select distinct city from station 
where NOT REGEXP_LIKE(City, '^[aeiouAEIOU]')
AND NOT REGEXP_LIKE(City, '[aeiouAEIOU]$');

# Higher Than 75 Marks

Query the Name of any student in STUDENTS who scored higher than  Marks. Order your output by the last three characters of each name. If two or more students both have names ending in the same last three characters (i.e.: Bobby, Robby, etc.), secondary sort them by ascending ID.

In [ ]:
SELECT NAME FROM STUDENTS
WHERE MARKS > 75
ORDER BY SUBSTR(NAME,-3,3),ID ASC;

# 오답 : SECONDARY SORT 기준 -> ORDER BY SUBSTR(NAME,-3,3),ID ASC;
# SUBSTR 뒤에 ID가 있으면 두번째 기준이 됨.

# Employee Names

Write a query that prints a list of employee names (i.e.: the name attribute) from the Employee table in alphabetical order.

In [ ]:
SELECT NAME FROM EMPLOYEE
ORDER BY NAME ASC;

# Employee Salaries

Write a query that prints a list of employee names (i.e.: the name attribute) for employees in Employee having a salary greater than  per month who have been employees for less than  months. Sort your result by ascending employee_id.

In [ ]:
SELECT NAME FROM EMPLOYEE
WHERE SALARY > 2000
AND MONTHS < 10
ORDER BY EMPLOYEE_ID ASC;

# Weather Observation Station 17

Query the Western Longitude (LONG_W)where the smallest Northern Latitude (LAT_N) in STATION is greater than . Round your answer to  decimal places.

In [ ]:
SELECT ROUND(LONG_W,4) FROM STATION
WHERE LAT_N IN (SELECT MIN(LAT_N) FROM STATION WHERE LAT_N > 38.7780 );

SELECT ROUND(LONG_W,4) FROM STATION
WHERE LAT_N I= (SELECT MIN(LAT_N) FROM STATION WHERE LAT_N > 38.7780 );

# Weather Observation Station 18

Consider  and  to be two points on a 2D plane.

 happens to equal the minimum value in Northern Latitude (LAT_N in STATION).
 happens to equal the minimum value in Western Longitude (LONG_W in STATION).
 happens to equal the maximum value in Northern Latitude (LAT_N in STATION).
 happens to equal the maximum value in Western Longitude (LONG_W in STATION).
Query the Manhattan Distance between points  and  and round it to a scale of  decimal places.

In [ ]:
# SELECT LAT_N,LONG_W FROM STATION
# WHERE LAT_N = (SELECT MIN(LAT_N) FROM STATION)
# AND LONG_W = (SELECT MIN(LONG_W) FROM STATION)


# SELECT LAT_N FROM STATION
# WHERE LAT_N = (SELECT MIN(LAT_N) FROM STATION)
# # 25.07

# SELECT LONG_W FROM STATION
# AND LONG_W = (SELECT MIN(LONG_W) FROM STATION)
# # 25.10

SELECT ROUND( MAX(lat_n)-MIN(lat_n) + MAX(long_w)-MIN(long_w), 4) FROM Station;